#    -*- mode: org -*-


Archived entries from file c:/Documents and Settings/danny.woods/Emacs/elisp/org-files/work.org

* DONE Ethernet API						       :ARCHIVE:
  CLOSED: [2008-10-30 Thu 14:47]
  :CLOCK:
  CLOCK: [2008-10-28 Tue 10:53]--[2008-10-28 Tue 14:14] =>  3:21
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-03-20 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  :END:
  Gordon's modified the Ethernet API for the MicroController to use sysfs rather than probing the system with ioctls, as the former is more reliable for detecting whether or not the ethernet cable is plugged in.
** DONE Test.
   CLOSED: [2008-10-29 Wed 16:36]
   CLOCK: [2008-10-29 Wed 13:25]--[2008-10-29 Wed 16:27] =>  3:02
   [2008-10-29 Wed 12:46] - testing.  Crashing Linux on the board.
   - Remotely debugging with GDB
     |----------------------------------+-----------------------------------------------------|
     | board                            | client                                              |
     |----------------------------------+-----------------------------------------------------|
     | gdbserver :999 ./MicroController |                                                     |
     |                                  | bfin-linux-uclibc-gdb -x gdb-init ./MicroController |
     |                                  | [issue gdb commands]                                |
     |----------------------------------+-----------------------------------------------------|

     - Not working too well: GDB not stopping; the fault appears to be getting triggered in the kernel.
       
       
   - Problem discovered in the serial manager code: listeners should be 'Pop'ed (new method) from the list, not 'Remove'd: the remove also deletes the object, which isn't good if it's shared.
 - Plug/unplug events of the ethernet are detected and logged, but it's more frantic than it should be in attempting to reconnect: some way of detecting whether or not the ethernet cable is plugged in is required.  This is NOT the same as up/down status, as the link may be in the 'down' state with the cable plugged in.  The difference is significant: when assigned a static IP address, 'ifconfig eth0 up' will cause the status of the link to change to 'up' even if there is no cable connected.  It will then immediately shift to 'down'.  The event generated by this causes the controller to attempt to setup the connection when it gets the 'up', which fails, brings the connection down, and then tries the 'up' again, which generates a false 'up' event, etc.
   
** DONE Physical ethernet connectivity interface
   CLOSED: [2008-10-30 Thu 12:07]
   :CLO
   CLOCK: [2008-10-30 Thu 09:15]--[2008-10-30 Thu 12:07] =>  2:52
   CLOCK: [2008-10-29 Wed 16:37]--[2008-10-29 Wed 17:33] =>  0:56
   :END:
   /usr/include/linux/mii.h appears to have some useful stuff.
   MII_BMSR -> 1
   blackfin kernel doesn't have SIOCGMIIREG, which is needed to fill the 'struct mii_data' that contains the connected/disconnected status.
   /sys/class/net/eth0/carrier is set to 1 when the line is connected, but only when the interface is in the 'up' state (it's openable but unreadable when the interface is 'down').  This allows a distinction to be drawn between 'up' and 'up with a cable connected'.
   Committed BFuClinuxEthernetAPI.cpp as revision 5869.
   
** DONE Test [4/4]						       :ARCHIVE:
   CLOSED: [2008-10-30 Thu 14:47]
   CLOCK: [2008-10-30 Thu 13:36]--[2008-10-30 Thu 14:47] =>  1:11
   - [X] interface up, cable in
	 MicroController starts up and connects correctly.
   - [X] interface up, cable out
	 MicroController starts up and fails to connect.  Repeatedly attempts to connect at 1s intervals.  Connects successfully when the cable is plugged in.
   - [X] interface down, cable in
	 MicroController starts up and brings eth0 up.  In the time that it takes to bring the interface up, the connection attempt fails.  When it then tries to reconnect a second later, it works fine.
   - [X] interface down, cable out
	 MicroController starts and brings eth0 up.  It then attempts to reconnect at one attempt/second until the cable is inserted, at which point it successfully communicates with the server.

** DONE Package up instructions for deployment.
   CLOSED: [2008-10-27 Mon 11:31]
   CLOCK: [2008-10-27 Mon 10:36]--[2008-10-27 Mon 11:23] =>  0:47
   - no fork() available
   - [[file:udev-124-no-fork.patch][patch]] required against udev 124
   - build on pundit with "CROSS_COMPILE=/opt/blackfin-uClibc-tools/linux-uclibc/bin/bfin-linux-uclibc- make"
   - udev rules file required to configure for:
     - telit modem (Vendor=1bc7 ProdID=1003)
     - gps dongle (Vendor=067b ProdID=2303)
   - mkdir -p /etc/udev/rules.d -- the udev rules files go in this directory
   - create the file /etc/udev/rules.d/50-udev.rules
     - the .rules file extension is important: udev looks for *.rules files in the 2rules directory.
     - the 50- prefix is also important: it tells udev in which order to load the rules file.  50 is normal priority
** DONE Check-in patch for MicroController
   CLOSED: [2008-10-27 Mon 12:02]
   CLOCK: [2008-10-27 Mon 11:23]--[2008-10-27 Mon 12:01] =>  0:38
   MicroController currently has code that attempts to parse sense out of sysfs.  udev does a much better job of this, and should be used in preference.  Using udev also means that the code can be reduced to checking for the presence of symlinks: far simpler and less error-prone.
   - committed as changes to MC/ConsoleApp/include/Arch/Blackfin-uClinux/BFuClinuxSerialManager.h and MC/ConsoleApp/src/Arch/Blackfin-uClinux/BFuClinuxSerialManager.cpp in r5828.
* DONE Update MainController.cpp with config settings		       :ARCHIVE:
  CLOSED: [2008-11-04 Tue 15:43]
  As per [[file:mark4-config.ini][mark-4 config]]
  :CLOCK:
  CLOCK: [2008-11-03 Mon 09:14]--[2008-11-03 Mon 10:30] =>  1:16
  CLOCK: [2008-10-31 Fri 10:25]--[2008-10-31 Fri 16:25] =>  6:00
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-03-20 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  :END:
  
|--------------------------+------------------------------------+---------------------|
| FILE                     | Config option                      | Checked in revision |
|--------------------------+------------------------------------+---------------------|
| hardware_version         | Config::hardware_model             | r5878               |
| connect_mode             | Config::connection_methods         | r5878               |
| name                     | Config::encoder_name               | r5878               |
| server                   | Config::server_address             | r5878               |
| username                 | NOT USED                           | --                  |
| password                 | Config::password                   | r5878               |
| enable_encryption        | Config::use_encryption             | r5878               |
| enable_archive           | Config::archive_recording          | r5878               |
| remote_archive_playback  | Config::archive_playback           | r5878               |
| archive_fps              | NOT USED                           | --                  |
| time_zone                | Config::time_zone                  | r5878               |
| vpn_enabled              | Config::ipsec_enabled              | r5878               |
| vpn_username             | Config::ipsec_vpn_username         | r5878               |
| remote_address           | Config::ipsec_remote_address       | r5878               |
| pre_shared_key           | Config::ipsec_pre_shared_key       | r5878               |
| vpn_keyexchange_method   | Config::ipsec_key_exchange_method  | r5881               |
| vpn_keyexchange_group    | Config::ipsec_key_exchange_group   | r5881               |
| vpn_encryption_algorithm | Config::ipsec_encryption_algorithm | r5881               |
| network_ip               | Config::ethernet_ip_address        | r5878               |
| wireless_modem_type      |                                    |                     |
| wireless_profiles        |                                    |                     |
| wireless_apn             | Config::telit_apn                  | r5878               |
| wireless_username        | Config::telit_user                 | r5878               |
| wireless_password        | Config::telit_password             | r5878               |
| wireless_ip              | Config::telit_ip_address           | r5878               |
|--------------------------+------------------------------------+---------------------|

* DONE Test rs485 interface					       :ARCHIVE:
  CLOSED: [2008-11-05 Wed 10:21]
  :CLOCK:
  CLOCK: [2008-11-04 Tue 10:31]--[2008-11-04 Tue 15:43] =>  5:12
  CLOCK: [2008-11-03 Mon 11:00]--[2008-11-03 Mon 14:30] =>  3:30
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-03-20 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  :END:
**** Test Plan [3/3]
     CLOCK: [2008-11-05 Wed 09:05]--[2008-11-05 Wed 10:21] =>  1:16
     - [X] data can be sent to blackin
     - [X] data cen be received from blackfin
     - [X] what happens when the 120ohm terminator resistor is removed?
	   Data sent fine over the short cable used (12")
* DONE Test the rs422 interface					       :ARCHIVE:
  SCHEDULED: <2008-11-05 Wed> - need that board from Andrew CLOSED: [2008-11-05 Wed 13:43]
  CLOCK: [2008-11-04 Tue 16:04]--[2008-11-04 Tue 16:45] =>  0:41
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-03-20 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  Additional pair of wires for +ve and -ve Rx line.
** DONE Test Plan [3/3]
   CLOSED: [2008-11-05 Wed 13:43]
   CLOCK: [2008-11-05 Wed 10:22]--[2008-11-05 Wed 13:43] =>  3:21
   - [X] data can be sent to blackin
   - [X] data cen be received from blackfin
	 disabling 485 mode for the serial on the MarkII seems problematic...
   - [X] what happens when the 120ohm terminator resistor is removed?
	 Data sent fine over the short cable used (12")
     Works with the short cable used (~1m).
     works normally over the ~1m cable used.
** DONE Design SerialManager/SerialPorts
   CLOSED: [2008-11-06 Thu 17:42]
   :CLOCK:
   CLOCK: [2008-11-05 Wed 14:30]--[2008-11-05 Wed 17:30] =>  3:00
   :END:
   The serial manager code needs to be written for the MicroController.
   Much of it is actually already written...
   EV_Object <- SerialPort <- RS232Port <- BFuClinuxRS232Port
   All we're really interested in is what happens immediately after opening (422) or before and after each write (485).
   Hooks in SerialPort, with 422 and 485 subclasses?
   232, 485 and 422 are platform independent constructs: it can be argued that they belong in a platform-independent hierarchy.
   Multiple inheritance: platform-specific XXXSerialPort class, with subclasses implementing specific, spec-dependent functionality.
** DONE RS485/422 implementations
    CLOSED: [2008-11-06 Thu 17:43]
   :CLOCK:
    CLOCK: [2008-11-06 Thu 09:31]--[2008-11-06 Thu 16:36] =>  7:05
    :END:
    comitted code containing refactoring of SerialPort code for the Blackfin.  Re-jigged 232 submitted along with new classes for 485 and 422.  Andrew tested the 232 code against the Telit modem for me, and it appears to work fine.
** DONE SerialManager Integration
   CLOSED: [2008-11-07 Fri 14:33]
   :CLOCK:
   CLOCK: [2008-11-07 Fri 10:20]--[2008-11-07 Fri 14:33] =>  4:13
   :END:
   Currently, the SerialManager for the BlackFin creates SerialPort objects for the RS232 port, the Telit modem, and the GPS dongle.  The 485/422 port is unused.  The 485 and 422 port classes are separate (and should probably remain so), so how should which instance to create be determined?  This should probably be switchable at runtime, right?
   - The PTZController requests a serial port from the SerialManager based on the profile information for the camera: this is supplied externally.
   AcquireSerialPort on the blackfin serial manager treats the devices "rs232", "rs485" and "rs422" specially.  The SerialPort instance that is actually returned carries the real name of its physical device, allowing 485 and 422 to be mutually exclusive, as is required by the physical port being the same for both.
   - Committed as r5995.
** DONE RS232 H/W Flow Control
   CLOSED: [2008-11-12 Wed 13:49]
   :CLOCK:
   CLOCK: [2008-11-12 Wed 09:05]--[2008-11-12 Wed 09:32] =>  0:27
   CLOCK: [2008-11-11 Tue 09:30]--[2008-11-11 Tue 12:26] =>  2:56
   CLOCK: [2008-11-10 Mon 11:22]--[2008-11-10 Mon 17:34] =>  6:12
   :END:
   Updated firmware supplied by Gordon.
   Using the same [[serial-test.c]] program above, modified for RS232 and setting H/W flow control.
   Writing to the serial port appears to work fine.
   Reading doesn't work?
   Seems to work fine on tweaked serial-test.c, although minicom/picocom both seem to have when communicating with each other.
   Seems to be possible to get the board into a bad state, requiring a reboot in order to get back to solid serial comms again.  Haven't seen this since the last code tweak, so maybe it's not a problem.
   Have successfully operated in reading & writing at 56Kb for upwards of an hour.
   Physical connection can be interrupted and resumed without unexpected effect.
   <2008-11-11 Tue 11:00> The problem appears to be with the data sent: if the data contains a newline character, it is processed as expected.  Without this character, the receiving end will never process the data.
   Tested this hypothesis with a Mark II box hooked up to Pundit: RS232 serial comms work fine regardless of the direction of the traffic or whether the newline is there or not.  With the Mark III/IV board, the newline is required if the board is in read mode.
   This /may/ have something to do with the shell that's connected to /dev/ttyBF0 on the BlackFin: Gordon is building a new image that doesn't have this shell in order to try it out.
   The shell on ttyBF0 will *not* be in the production system (according to Gordon).
   <2008-11-11 Tue 12:26> Waiting on a new build of the firmware from Gordon.
   <2008-11-11 Tue 17:00> The test without the shell attached to the tty was no different: the characters were still not received.
   Have supplied test code and symptoms to Tony, who has forwarded them on to Ian Jeffrey.
   <2008-11-12 Wed 09:30> Ian says that the sample code works fine for him, both to and from the board.  I'm wondering if he's run the reader on the board more than once, as I've seen the reader work without the newline character on an intermittent basis.  I've replied with an email to this effect.
   <2008-11-12 Wed 11:07> Ian recommended using the 'set bootargs console=null' option to completely detach the the boot process from the console.  This appears to clean up the issues, but one remains:
      - boot the board with the 'set bootargs console=null' option
      - copy serial-test to the board, and run with './serial-test --read --device=/dev/ttyBF0 --232 --hwfc'.  It'll hang waiting for input.
      - on the PC end, run './serial-test-pc --write --device=/dev/ttyS0 --232 --hwfc'.  The writer freezes at a count of 4095, while the reader does nothing.  However, if you then interrupt the reader and restart, it will read the bytes sent--freeing up the writer--and thereafter work correctly for various combinations of stopping/starting the reader or writer.
      - <2008-11-12 Wed 12:17> confirmed that this is reproducible on the new board.  Sent an email to Ian asking for confirmation.
      - <2008-11-12 Wed 13:47> Ian has confirmed that he can replicate the fault, and recomments raising RTS when the port is opened to explicitly enable data receipt on a cold boot.  This is apparently a distinction drawn between RS232-C (which we have) and RS232-E (which specifies being able to read on open by default).  Whether or not this is a valid assertion is debatable, but his workaround certainly does the trick.
* DONE Encryption Pack Config					       :ARCHIVE:
  CLOSED: [2008-11-11 Tue 16:05]
  CLOCK: [2008-11-11 Tue 13:30]--[2008-11-11 Tue 15:24] =>  1:54
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-03-20 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  'Key store' object in the C microcontroller: defined in CommsLibrary/Include/Encryption/Basic/EV_BasicRSAKeyStore.h
  Code commited as r6072.
** DONE Check Windows version builds
   CLOSED: [2008-11-11 Tue 15:35]
   CLOCK: [2008-11-11 Tue 15:24]--[2008-11-11 Tue 15:35] =>  0:11
   Broken in MC/UnitTest/Src/Arch/Windows/main.cpp -- fixed and committed.
* DONE PTZ Testing						       :ARCHIVE:
  CLOSED: [2008-11-13 Thu 11:49]
  :CLOCK:
  CLOCK: [2008-11-12 Wed 14:01]
  CLOCK: [2008-11-12 Wed 13:49]--[2008-11-12 Wed 13:59] =>  0:10
  :END:
  Now that the SerialManager appears to be feature complete, the PTZ commands need to be tested.
  Physical Requirements
  :properties:
    a board with a running MicroController
    a Network Server
    a camera (Sony Visca and Canon cameras available)
    a Network Manager
    :ARCHIVE_TIME: 2009-03-20 Fri 16:21
    :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
    :ARCHIVE_CATEGORY: work
    :ARCHIVE_TODO: DONE
  :end:
  <2008-11-12 Wed 14:01> This is currently not possible, as the Network Manager/Server will not work without a video stream, which is currently unavailable.  Tony has a possible solution based on some work done a while ago; he is investigating.
  <2008-11-12 Wed 14:25> Tony has supplied a setup that appears to work, once I can understand it.
  A service called 'TVNP' routes the PTZ commands.

  | TVNP Client (Laptop) --> TVNP Server (Tony's Desktop) -->  Network Server  --> MicroController --> Camera |

  No video involved.
** DONE Steer the Sony Visca camera
   CLOSED: [2008-11-13 Thu 11:49]
   CLOCK: [2008-11-13 Thu 09:31]--[2008-11-13 Thu 11:49] =>  2:18
   Corrected a fault with parity detection on the serial port class (PARITY_TYPE_NONE means NO parity, idiot).
   Can get a Sony Visca to move, although the level of control is limited/flaky.  In particular, it's difficult to make it stop.
   All data IS being written to the serial port.
   The possibility of the shell attached to the tty interfering with the commands remains.
   Need to boot the board into dev mode.
   'evdevmode=yes' in the boot environment is enough...
   ...or would be if /etc/rc wasn't buggy.  The code that determines dev-mode is broken:
   
   [ "$devmode" = "no" ] && devmode=`dd if=/dev/mtd0 skip=2 bs=8192 count=1 2>&1 | grep 'evdevmode=' | head -n 1 | cut -f2 -d=`
   [ "$devmode" = "no" ] && devmode=`dd if=/dev/mtd1 bs=8192 count=1 2>&1 | grep evdevmode | cut -f2 -d=`
   [ "$devmode" = "no" ] && devmode=`dd if=/dev/mtd5 bs=8192 count=1 2>&1 | grep evdevmode | cut -f2 -d=`

   In my case, the second 'dd' is what yields the 'yes', but the first test blots $devmode to being '', so the set never succeeds.
   Need Gordon to build a new image, but he's busy with the chap from A2E at the moment.
   The .DEVMODE pendrive hack doesn't work, either: the USB system hasn't initialised the device by the time the existence of /pendrive/.DEVMODE file is checked, so it can't be mounted.
   <2008-11-12 Wed 17:42> That's probably enough for today.
   <2008-11-13 Thu 11:31> Gordon built a new firmware image, correcting the /etc/rc script.  The Visca camera works fine.  The Canon required a correction to the Stop command, and also to the code that determines the panning speed.  Code checked in, and unit tests aligned with changes.

* DONE Enable camera/protocol switching on the PTZController	       :ARCHIVE:
  CLOSED: [2008-11-13 Thu 13:03]
  CLOCK: [2008-11-13 Thu 11:51]--[2008-11-13 Thu 13:03] =>  1:12
  The controller currently doesn't account for the scenario where you've just switched the camera attached to the RS232 port.
  All it sees is that there's a non-NULL object in the place that matches the address.
  Need to match on the protocols as well, and delete/recreate the slot as required.
  Unit tested clean and manually verified against Visca and Canon cameras.  Code checked in.

* DONE How to setup an IPsec gateway for testing		       :ARCHIVE:
  CLOSED: [2008-11-20 Thu 16:32]
  :CLOCK:
  CLOCK: [2008-11-20 Thu 11:34]--[2008-11-20 Thu 12:14] =>  0:40
  CLOCK: [2008-11-13 Thu 13:55]--[2008-11-13 Thu 14:19] =>  0:24
  :END:
  Host: evdemo@us.evdemo.net
  Kernel: 2.4.21-32.0.1.EL
  According to http://www.freeswan.org/freeswan_trees/freeswan-1.91/doc/install.html, NETFILTER is required in the kernel config, but it's missing.
  Two Ubuntu images running in VMWare.

  |-----------------------------------------------------------------|
  | Client (192.168.163.128)                                        |
  |-----------------------------------------------------------------|
  | Only one network interface required, IP address 192.168.163.128 |
  | [[file:client-racoon.conf][racoon.conf]] as linked                                           |
  | [[file:client-psk.txt][psk.txt]] as linked, permissions 400/root:root                    |
  | setkey configured as per [[file:setkey-config.txt][setkey-config]]                          |
  | setkey -f setkey-config                                         |
  | racoon -f racoon.config                                         |
  |-----------------------------------------------------------------|

  |---------------------------------------------------------------------------------------------|
  | Server (eth1 192.168.163.129, eth1:1 192.168.2.10)                                          |
  |---------------------------------------------------------------------------------------------|
  | Two network interfaces, as above.                                                           |
  | [[file:server-racoon.conf][racoon.conf]] as linked                                                                       |
  | [[file:client-psk.txt][psk.txt]] as linked, permissions 400/root:root                                                |
  | setkey does NOT need to be configured ("generate_policy on;" in racoon config handles this) |
  | racoon -f racoon.config                                                                     |
  | 'ping 192.168.2.10' should work                                                             |
  |---------------------------------------------------------------------------------------------|

  At this point, the private host 192.168.2.10 is behind the gateway is visible to the client 192.168.163.128, with all communications between the two encrypted.

  'racoon -f /var/racoon/racoon.conf -l racoonf.debug -ddd -v -F' is useful for printing out tons of information.
  'tcpdump -i ethX' is also very useful for seeing what's getting sent.
   
* DONE Keyboard PTZ Visca issue					       :ARCHIVE:
  CLOSED: [2008-11-21 Fri 16:40]
  :CLOCK:
  CLOCK: [2008-11-20 Thu 13:31]--[2008-11-20 Thu 14:34] =>  1:03
  :END:
  When driven from the viewer, holding down one of the directional keys should result in an initial slow speed, then an increase to medium speed.
  The sequence of commands is [move]-slow --> stop --> [move]-medium
  The Visca doesn't hit medium speed, stopping instead.
  It works as expected with the LMW camera using v6.5.0 of the viewer
  The 'stop' and 'move-medium' commands are issued immediately after each other in code, so it's entirely possible that it's a timing issue.
  Be aware, however, that these actions occur on the same thread as the video encoder, so holding up that thread with a lengthy sleep is not a good idea.
  The original Ruby implementation sleeps for three hundred(!) milliseconds: no way this can be done in the C++ version unless the PTZController runs on a separate thread.
  [2008-11-20 Thu 14:32] - Implemented something that looks sensible, but I need a board to test it against: Gordon needs mine for its JTAG interface.
  [2008-11-21 Fri 09:15] - The current implementation works for me?  Progressing with the revamped implementation isn't sensible, given that the demo is happening next week.  Definitely something to test in dev-land.
  [2008-11-21 Fri 16:39] - The 'fix' actually introduces the bug on my machine!  Have tar'd up the modified files and reverted to the repository sources.
* DONE Canon PTZ						       :ARCHIVE:
  CLOSED: [2008-11-24 Mon 17:37]
  CLOCK: [2008-11-24 Mon 10:30]--[2008-11-24 Mon 17:37] =>  7:07
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-03-20 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  The Canon camera is unusual in that it issues responses to commands.
  These commands MUST be read before further commands are issued.  This means that the sender effectively has to block until it has read the response.
  This requires a re-working of the PTZController to operate on its own thread.  Otherwise, the delays will cause problems for the video encode thread, which issues the commands.
  Raw, EV-side PTZ commands can now be either 4 or 5 bytes, not just the 4 that was originally set.
  To avoid cluttering the code, all commands are turned into 5 byte commands before processing: if a command looks like it's 4 bytes long, the camera address from byte 3 is jammed into byte 5.
  Controller re-worked and bugs ironed out.  The controller maintains a circular buffer of 10 5-byte PTZ commands.
  Canon implementation responses debugged: the end of the responses (0xEF) wasn't being properly detected, leading to timeouts and delays.
  Presets, keyboard and navigation buttons work fine now.
  Committed as revision 6371.
* DONE Review Mark IV Documentation				       :ARCHIVE:
  CLOSED: [2008-12-09 Tue 10:58]
  CLOCK: [2008-12-09 Tue 09:22]--[2008-12-09 Tue 10:58] =>  1:36
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-03-20 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  Picked up some minor problems.
  Suggestions:
  Linux installer, even if it's only console based
  Troubleshooting guide
  Glossary
  Links to tools (daemontools, Google Earth, etc.)
* DONE Determine setup for synchronous serial demo		       :ARCHIVE:
  CLOSED: [2008-12-17 Wed 09:39]
  CLOCK: [2008-12-16 Tue 12:22]--[2008-12-16 Tue 16:12] =>  3:50
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-03-20 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  According to the documentation, the card has an internal oscillator and can generate its own clock signal.
  The card can remember configuration that it's been set with between power cycles: all we effectively need is RS232 mode.
* DONE Provide Brenda with sync serial hardware/cabling details.
  CLOSED: [2009-04-06 Mon 10:01]
  CLOCK: [2009-04-06 Mon 09:10]--[2009-04-06 Mon 10:01] =>  0:51
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-06-11 Thu 11:46
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  Sent email with diagrams covering the basic setup.
* DONE Honour transmit duration field in 'start video' command.
  CLOSED: [2009-04-06 Mon 13:57]
  CLOCK: [2009-04-06 Mon 11:56]--[2009-04-06 Mon 12:35] =>  0:39
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-06-11 Thu 11:46
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
* DONE Set video dimensions according to those specified in 'start video' command.
  CLOSED: [2009-04-06 Mon 15:22]
  CLOCK: [2009-04-06 Mon 13:57]--[2009-04-06 Mon 15:21] =>  1:24
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-06-11 Thu 11:46
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
* DONE Enable/disable the temporal median filter
  CLOSED: [2009-04-06 Mon 15:33]
  CLOCK: [2009-04-06 Mon 15:21]--[2009-04-06 Mon 15:33] =>  0:12
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-06-11 Thu 11:46
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
* DONE Get Dave's JavaSerialCat program to Ray			       :ARCHIVE:
  SCHEDULED: <2009-06-24 Wed>
  :CLOCK:
  CLOCK: [2009-06-24 Wed 09:10]--[2009-06-24 Wed 15:14] =>  6:04
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-07-10 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  :END:
* DONE Implement read caching in ByteSyncedReadStream [3/3]	       :ARCHIVE:
  SCHEDULED: <2009-06-24 Wed> CLOSED: [2009-06-24 Wed 15:15]
  :CLOCK:
  CLOCK: [2009-06-24 Wed 10:15]--[2009-06-24 Wed 15:15] =>  5:00
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-07-10 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  :END:
  - [X] Write Unit tests
  - [X] Code
  - [X] Integrate into ByteSyncedReadStream
* DONE Test Control Center manually				       :ARCHIVE:
  SCHEDULED: <2009-06-24 Wed> CLOSED: [2009-06-24 Wed 15:17]
  :CLOCK:
  CLOCK: [2009-06-24 Wed 13:45]--[2009-06-24 Wed 14:45] =>  1:00
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-07-10 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  :END:
  Tested with the PCMCIA card in pull mode, as I'm still suspicious of encoders being permanently stuck in push.
* DONE Provide Ray with updated Control Center.			       :ARCHIVE:
  SCHEDULED: <2009-06-24 Wed> CLOSED: [2009-06-24 Wed 15:18]
  CLOCK: [2009-06-24 Wed 14:45]--[2009-06-24 Wed 15:18] =>  0:33
  :PROPERTIES:
  :ARCHIVE_TIME: 2009-07-10 Fri 16:21
  :ARCHIVE_FILE: ~/Emacs/elisp/org-files/work.org
  :ARCHIVE_CATEGORY: work
  :ARCHIVE_TODO: DONE
  :END:
  Build instructions from Steven.
  - [one-off] Install NSIS 2.4.0 (in \\steven\shared)
  - [one-off] Copy the Plugins folder from the \\steven\shared\NSIS into C:\Program Files\NSIS (overwriting the original Plugins folder)
  - Checkout https://evdev/svn/products/rebranding
  - Choose a sub-project (tvi_radio_viewer in this case)
  - Open a Visual Studio command prompt, and go to that directory.
  - run 'rebrand.bat' to see usage.  Normal usage would be 'rebrand.bat build 3.1.0 my-tvi-radio-viewer'
    This checks out the code from Subversion, builds it, creates the named folder ('my-tvi-radio-viewer')
    and places the installer in it.  The folder is relative to the root of the 'rebranding' project, not
    the working project.
